Repository: d6lts/image
Catalog: po/*.po
Languages: sv

source: <p>Admins may create many image nodes at once by uploading all images to a folder on the server. This upload happens outside of Drupal, usually using an FTP client.</p>
sv: <p>Administratörer kan skapa flera bildnoder på en gång genom att ladda upp alla bilder till en katalog på servern. Denna uppladning sker utanför Drupal, vanligtvis via ett FTP-program.</p>

source: Allows uploading of images and creating image galleries.
sv: Gör det möjligt att ladda upp bilder och skapa bildgallerier.

source: An image (with thumbnail). This is ideal for publishing photographs or screenshots.
sv: En bild (med miniatyr). Detta är lämpligt för publicering av fotografier eller skärmdumpar.

source: Image galleries can be used to organize and present groups of images. Galleries may be nested. To add a new gallery click the "add gallery" tab.
sv: Bildgallerier kan användas för att organisera eller presentera grupper av bilder. Bildgallerier kan ha undergallerier. För att lägga till ett nytt bildgalleri, klicka på "lägg till bildgalleri".

source: Below is a status of image module's current configuration.
sv: Nedan är statusen för bildmodulens nuvarande konfigurering.

source: <h4>Fast Mode</h4><ul> <li>Creates all image nodes at once without user interaction.</li> <li>Applies the same taxonomy term(s) to each node, thus creating a gallery.</li> <li>If IPTC data is present in the image, the headline and caption fields are used to populate the title and body respectively.</li> <li>If the image dimensions are bigger than the maximum allowed, the image is automatically scaled down.</li></ul>
sv: <h4>Snabbläge</h4><ul> <li>Skapar alla bildnoder på en gång utan användarens inblandning.</li> <li>Applicerar samma taxonomiterm(er) på varje nod, och skapar på så sätt ett galleri.</li> <li>Om IPTC-information finns i bilden så används rubriken och bildtexten till nodens rubrik respektive bildtext.</li> <li>Om bildstorleken är större än den maximalt tillåtna så skalas bilden automatiskt ner.</li></ul>

source: <h4>Slow Mode</h4><ul> <li>Manipulate each image individually (i.e. crop, rotate, etc.).</li> <li>Add custom titles, descriptions, etc.</li></ul>
sv: <h4>Långsamt läge</h4><ul> <li>Förändra varje bild individuellt (ex. beskär, rotera, etc.).</li> <li>Lägg till egna rubriker, beksrivningar etc.</li></ul>

source: Allow users to upload images and to display them in shared and personal image galleries.
sv: Gör det möjligt för användare att ladda upp bilder och visa dem i delade och personliga bildgallerier.

source: Images can be uploaded into either shared or personal galleries. Once images are uploaded they can be manipulated. The image system will auto-generate thumbnails for all images to be used in other nodes via filters and in gallery navigation. These settings allow you to control where images are placed, how they are displayed, and any restrictions that should be enforced.
sv: Bilder kan laddas upp till antingen delade eller personliga gallerier. När bilderna är uppladdade kan de färändras. Bildsystemet skapar automatiskt miniatyrer av alla bilder som kan användas i andra noder via fildter och via gallerinavigationen.

source: An image you can insert into nodes, or see in image galleries.
sv: En bild som du kan infoga i noder eller visa i bildgallerier.

source: You may link to images on this site <a href="%explanation-url">using a special syntax</a>
sv: Du kan länka till bilder på denna webbplats <a href="%explanation-url">med ett speciellt syntax</a>

source: Default image path
sv: Standardsökväg för bilder

source: Subdirectory in the directory "%dir" where pictures will be stored.
sv: Underkatalog till katalogen "%dir" där bilderna kommer att sparas.

source: File paths
sv: Sökväg

source: <p>You may quickly link to image nodes using a special syntax. The image code(s) will be replaced by thumbnail linked to full size image node. Syntax: <code>[image:node_id,(left|right|top|middle|bottom|absmiddle|texttop|baseline),hspace,vspace,border]</code>. Every parameter except node_id is <em>optional</em>.</p>
sv: <p>Du kan snabbt länka till bildnoder med ett speciellt syntax. Bildkoderna kommer att ersättas med miniatyrbilder som länkas till originalbildens högupplösta bildnod. Syntax: <code>[image:node_id,(left|right|top|middle|bottom|absmiddle|texttop|baseline),hspace,vspace,border]</code>. Varje parameter utom node_id är <em>frivillig</em>.</p>

source: image
sv: bild

source: Label
sv: Etikett

source: Width
sv: Bredd

source: Height
sv: Höjd

source: Select various pixel dimensions, "thumbnail" and "preview" are required.
sv: Ange olika pixeldimensioner, "miniatyr" och "förhandsvisning" är obligatoriska.

source: Allow users to view original image
sv: Tillåt användare att visa originalbild

source: Image sizes
sv: Bildstorlekar

source: Images per page
sv: Bilder per sida

source: Sets the number of images to be displayed in a gallery page.
sv: Anger antal bilder som ska visas på en bildgallerisida

source: Gallery settings
sv: Galleriinställnignar

source: Explanation or submission guidelines
sv: Förklaring eller riktlinjer för inlägg

source: This text will be displayed at the top of the image submission form. It is useful for helping or instructing your users.
sv: Denna text visas högst upp på inmatningsformuläret för bilder. Texten kan användas för att hjälpa och instruera användare.

source: Default path for uploaded images relative to your Drupal installation; it must be writeable and visible from the web. Don't forget the slash (/) at the end.
sv: Standardsökväg för upladdade bilder, relativt till din Drupal-installation. Katalogen måste vara skrivbar och åtkomlig från webben. Glöm inte snedstrecket (/) i slutet.

source: Default thumb path
sv: Standardsökväg för miniatyrer

source: Default path for thumbnails relative to your Drupal installation; it must be writeable and visible from the web. Don't forget the slash (/) at the end.
sv: Standardsökväg för miniatyrer relativt till din Drupal-installation. Katalogen måste vara skrivbar och åtkomlig från webben. Glöm inte snedstrecket (/) i slutet.

source: Temporary image path
sv: Sökväg för tillfälliga bilder

source: Path for working directory relative to your Drupal installation; it must be writeable and visible from the web. Don't forget the slash (/) at the end.
sv: Sökväg till arbetskatalog relativt till din Drupal-installation. Katalogen måste vara skrivbar och åtkomlig från webben. Glöm inte snedstrecket (/) i slutet.

source: Maximum temporary image directory size
sv: Maximal storlek på katalogen för tillfälliga bilder

source: MBytes.
sv: MByte.

source: Stored images filenames
sv: Lagrade bilders filnamn

source: The filename of an image stored on the server could be based on an unique random string or include the original filename. In the later case, the node id will be appended to the filename.
sv: Filnamnet på en bild som lagras på servern kan baseras på antingen en unik slumpmässig textsträng eller originalfilens namn. I det senare fallet läggs nodens id till i filnamnet.

source: Default max image size
sv: Förvald maxstorlek på bilder

source: KBytes.
sv: Kbyte.

source: Default max image resolution
sv: Förvald maxupplösning på bilder

source: Example: 800x600.
sv: Exempel: 800x600

source: Default thumbnail resolution
sv: Förvald upplösning på miniatyrer

source: Default size of thumbnails: format will be the same as original image. Use just one dimension, and put a "x" to specify height. Examples: "100" for width of 100; "x200" for height of 200.
sv: Förvald miniatyrstorlek: formatet blir det samma som i originalbilden. Använd bara en dimension och använd "x" för att ange höjden. Exempel: "100" för bredden 100 och "x200" för höjden 200.

source: list
sv: lista

source: add gallery
sv: lägg till bildgalleri

source: Background Color
sv: Bakgrundsfärg

source: Color used to fill in background when rotating images.
sv: Färg som används för att fylla i bakgrunden vid bildrotering.

source: <none>
sv: <inget>

source: Gallery Navigation Vocabulary
sv: Vokabulär för bildgallerier

source: One of the taxonomy vocabularies will be the navigation tree. Select it here. Make sure that a term from this vocabulary is required.
sv: Ett taxonomi-vokabulär kommer att användas som galleriernas navigationsträd. Välj detta här. Se till att vokabuläret är obligatoriskt.

source: Gallery Thumbnails
sv: Galleriminiatyrer

source: Set the thumbnail to be dislayed on the gallery page.
sv: Ange vilken miniatyr som ska visas på gallerisidan.

source: Specify how many rows of thumbnails in each page of the gallery.
sv: Ange hur många rader med miniatyrer som ska visas på varje gallerisida.

source: Gallery Columns
sv: Gallerikolumner

source: Specify how many columns of thumbnails in each page of the gallery.
sv: Ange hur många kolumner med miniatyrer som ska visas på varje gallerisida.

source: Gallery Order
sv: Galleriordning

source: Order of thumbnails within a gallery. Lighter and heavier refer to weight property.
sv: Ordning på miniatyrerna i ett galleri. Lätt och tung har att göra med egenskapen tyngd.

source: Uploaded file is not a valid image
sv: Den uppladdade filen är inte en giltig bild.

source: image galleries
sv: bildgallerier

source: view original
sv: visa original

source: images
sv: bilder

source: Latest image
sv: Senaste bild

source: Random image
sv: Slumpmässigt vald bild

source: edit this image
sv: redigera denna bild

source: Edit this image.
sv: Redigera denna bild.

source: Thumbnail
sv: Miniatyr

source: Image
sv: Bild

source: Description
sv: Beskrivning

source: %t image gallery
sv: Bildgalleri %t

source: View %t image gallery.
sv: Visa bildgalleri %t.

source: previous image
sv: föregående bild

source: next image
sv: nästa bild

source: Image gallery
sv: Bildgalleri

source: Click "Browse..." to select an image to upload.
sv: Klicka på "Bläddra..." för att välja bilder för uppladdning.

source: Weight
sv: Vikt

source: Personal
sv: Personlig

source: The image file you are trying to upload is too big.
sv: Bildfilen du försöker ladda upp är för stor.

source: The image file was only partially uploaded. Please try again.
sv: Bildfilen laddades bara upp delvis. Var god försök igen.

source: You must select an image for upload.
sv: Du måste välja en bild som ska laddas upp.

source: Error processing image file.
sv: Fel inträffade vid behandling av bildfil.

source: Uploaded file was not an image.
sv: Den uppladdade filen var inte en bild.

source: image type '%type' is not supported.
sv: Bildtypen '%type' stöds inte.

source: The uploaded image(%ax%b) is too large (max %cx%d).
sv: Dne uppladdade bilden(%ax%b) är för stor (max %cx%d).

source: Image filter
sv: Bildfilter

source: Image codes
sv: Bildkoder

source: Cannot save image.
sv: Kan inte spara bilden.

source: Cannot delete old image.
sv: Kan inte radera gammal bild.

source: Cannot delete old thumb.
sv: Kan inte radera gammal miniatyr.

source: File is too big (max %a kbytes)
sv: Filen är för stor (max %a kbyte)

source: Upload directory is full.
sv: Uppladdningskatalogen är full.

source: Resize/Crop
sv: Skala om/beskär

source: keep prop
sv: behåll prop

source: Rotate
sv: Rotera

source: clockwise
sv: medsols

source: background
sv: bakgrund

source: white
sv: vit

source: black
sv: svart

source: Convert
sv: Konvertera

source: Quality (1-100)
sv: Kvalitet (1-100)

source: Home
sv: Hem

source: Image galleries
sv: Bildgallerier

source: Access Denied
sv: Åtkomst nekad

source: There is 1 image in this album.
sv: Det finns 1 bild i galleriet.

source: There are %a images in this album.
sv: Det finns %a bilder i galleriet.

source: There are no images in this album.
sv: Det finns inga bilder i galleriet.

source: Last updated:
sv: Senast uppdaterad:

source: Directory to scan
sv: Katalog att söka igenom

source: Add new gallery
sv: lägg till bildgalleri

source: If needed, create a new term for this gallery by clicking on one of these vocabularies
sv: Om det behövs, skapa en ny term för detta galleri genom att klicka på ett av dessa vokabulär.

source: Directory upload
sv: Kataloguppladdning

source: is not a directory
sv: är inte en katalog

source: gallery
sv: galleri

source: is not an image.
sv: är inte en bild.

source: image type is not supported.
sv: bildtypen stöds inte.

source: Role
sv: Användarroll

source: Limit
sv: Begränsa

source: manipulate images
sv: manipulera bilder

source: access images
sv: åtkomst till bilder

source: create images
sv: skapa bilder

source: administer images
sv: administrera bilder

source: edit gallery
sv: redigera galleri

source: No galleries available
sv: Inga gallerier tillgängliga.

source: Gallery name
sv: Gallerinamn

source: The name is used to identify the gallery.
sv: Namnet används för att identifiera galleriet.

source: Last updated: %date
sv: Senast uppdaterad: %date

source: Posted by: %name
sv: Inlagd av: %name

source: Unable to create %label image
sv: Kan inte skapa bilden %label

source: thumbnail
sv: miniatyr

source: preview
sv: exempel

source: Image Galleries
sv: Bildgallerier

source: There is 1 image in this gallery
sv: Det finns en bild i detta galleri
